app/Http/Controllers/Site/SiteController.php

    public function index()
    {
        $plans = Plan::with('details')->orderBy('price','ASC')->get();
---
select * from `plans` order by `price` asc