app/Repositories/ProductRepository.php

    public function getProductsByTenantId(int $tenantId, array $categories)
    {
        return DB::table($this->table)
                ->join('category_product','category_product.product_id','=','products.id')
                ->join('categories','category_product.category_id','=','categories.id')
                ->where('products.tenant_id',$tenantId)
                ->where('categories.tenant_id',$tenantId)
                ->where(function($query) use($categories){
                    if($categories != []):
                        $query->whereIn('categories.uuid',$categories);
                    endif;
                })
                ->select('products.*')
                ->get();
---
select * from `products` inner join `category_product` on `category_product`.`product_id` = `products`.`id` inner join `categories` on `category_product`.`category_id` = `categories`.`id` where `products`.`tenant_id` = 1 and `categories`.`tenant_id` = 1